balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1789.PIC
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEP" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEP" edc:nzwidth="8" edc:por="----0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEP3" edc:desc="" edc:mask="0x1" edc:name="IOCEP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEN" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEN" edc:nzwidth="8" edc:por="----0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEN3" edc:desc="" edc:mask="0x1" edc:name="IOCEN3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEF" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEF" edc:nzwidth="8" edc:por="----0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="IOCEF3" edc:desc="" edc:mask="0x1" edc:name="IOCEF3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="8" edc:beginaddr="0x400" edc:endaddr="0x420" edc:regionid="sfr8">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="20"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="9" edc:beginaddr="0x480" edc:endaddr="0x4A0" edc:regionid="sfr9">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="10" edc:beginaddr="0x500" edc:endaddr="0x520" edc:regionid="sfr10">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-OPAMP_amp_opamp_hvpump_v1.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-OPAMP_amp_opamp_hvpump_v1.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1" edc:modsrc="DOS-OPAMP_amp_opamp_hvpump_v1.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLKRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00110000" edc:name="CLKRCON" edc:nzwidth="8" edc:por="00110000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV0" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV1" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDIV2" edc:desc="" edc:mask="0x1" edc:name="CLKRDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC0" edc:desc="" edc:mask="0x1" edc:name="CLKRDC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRDC1" edc:desc="" edc:mask="0x1" edc:name="CLKRDC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKRSLR" edc:desc="" edc:mask="0x1" edc:name="CLKRSLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKROE" edc:desc="" edc:mask="0x1" edc:name="CLKROE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLKREN" edc:desc="" edc:mask="0x1" edc:name="CLKREN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKRDIV" edc:desc="" edc:mask="0x7" edc:name="CLKRDIV" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CLKRDC" edc:desc="" edc:mask="0x3" edc:name="CLKRDC" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="5"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="11" edc:beginaddr="0x580" edc:endaddr="0x5A0" edc:regionid="sfr11">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01073_5bit_DAC.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01073_5bit_DAC.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
        </edc:Module_ref>
        <edc:Module_ref edc:begin="0x0" edc:end="0x2" edc:modsrc="DOS-01073_5bit_DAC.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
        </edc:Module_ref>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="12" edc:beginaddr="0x600" edc:endaddr="0x620" edc:regionid="sfr12">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7A0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xdae" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL0" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL0" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL0" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL0" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL1" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL1" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL1" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL1" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL2" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL2" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL2" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL2" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL3" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL3" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL3" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL3" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL4" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL4" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL4" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL4" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
