balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1789.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL32" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL32" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL32" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL32" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="TSTSARCAL33" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="TSTSARCAL33" edc:nzwidth="8" edc:por="--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSTSARCAL33" edc:desc="" edc:mask="0x3f" edc:name="TSTSARCAL33" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe20" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xef0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1f" edc:modsrc="DOS-01401.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="1"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x7"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x9"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xb"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xe"/>
          <edc:ModuleMacro edc:replace="%src1%" edc:with="C1"/>
          <edc:ModuleMacro edc:replace="%src2%" edc:with="C2"/>
          <edc:ModuleMacro edc:replace="%src3%" edc:with="C3"/>
          <edc:ModuleMacro edc:replace="%src4%" edc:with="C4"/>
          <edc:ModuleMacro edc:replace="%src7%" edc:with="IN"/>
          <edc:ModuleMacro edc:replace="%src0%" edc:with="T"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1f" edc:modsrc="DOS-01401.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="2"/>
          <edc:ModuleMacro edc:replace="%src0%" edc:with="T"/>
          <edc:ModuleMacro edc:replace="%src1%" edc:with="C1"/>
          <edc:ModuleMacro edc:replace="%src2%" edc:with="C2"/>
          <edc:ModuleMacro edc:replace="%src3%" edc:with="C3"/>
          <edc:ModuleMacro edc:replace="%src4%" edc:with="C4"/>
          <edc:ModuleMacro edc:replace="%src7%" edc:with="IN"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xe"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xb"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x9"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x7"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x5"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0xd"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x1d"/>
        </edc:Module_ref>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1f" edc:modsrc="DOS-01401.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="3"/>
          <edc:ModuleMacro edc:replace="%src0%" edc:with="T"/>
          <edc:ModuleMacro edc:replace="%src1%" edc:with="C1"/>
          <edc:ModuleMacro edc:replace="%src2%" edc:with="C2"/>
          <edc:ModuleMacro edc:replace="%src3%" edc:with="C3"/>
          <edc:ModuleMacro edc:replace="%src4%" edc:with="C4"/>
          <edc:ModuleMacro edc:replace="%src7%" edc:with="IN"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x7"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x9"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xb"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xe"/>
        </edc:Module_ref>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf30" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:Module_ref edc:begin="0x0" edc:end="0x1f" edc:modsrc="DOS-01401.Module">
          <edc:ModuleMacro edc:replace="@" edc:with="4"/>
          <edc:ModuleMacro edc:replace="%src0%" edc:with="T"/>
          <edc:ModuleMacro edc:replace="%src1%" edc:with="C1"/>
          <edc:ModuleMacro edc:replace="%src2%" edc:with="C2"/>
          <edc:ModuleMacro edc:replace="%src3%" edc:with="C3"/>
          <edc:ModuleMacro edc:replace="%src4%" edc:with="C4"/>
          <edc:ModuleMacro edc:replace="%src7%" edc:with="IN"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xe"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xb"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0xa"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x9"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x8"/>
          <edc:ModuleExclude edc:impl="0x9f" edc:offset="0x7"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x4"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x5"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0xd"/>
          <edc:ModuleExclude edc:impl="0xc3" edc:offset="0x1d"/>
        </edc:Module_ref>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="88"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
